xml/Authorize.xml

<x:Envelope xmlns:x="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="urn://Ocpp/Cs/2012/06/">
    <x:Header>
        <ns:chargeBoxIdentity>{{.ChargeBoxID}}</ns:chargeBoxIdentity>
        <wsa5:Action>/Authorize</wsa5:Action>
    </x:Header>
    <x:Body>
        <ns:authorizeRequest>
            <ns:idTag>{{.AuthID}}</ns:idTag>
        </ns:authorizeRequest>
    </x:Body>
</x:Envelope>